---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutWarn
source: html/a09b3252-0da1-7a42-4c24-49ace6db72b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutWarn Property

Fail to generate the automatic landing layout

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsAutomaticLandingLayoutWarn { get; }
```